{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "benign",
    "1": "deserialization",
    "2": "graphql_attacks",
    "3": "jwt_attacks",
    "4": "lfi",
    "5": "modern_cmdi",
    "6": "modern_file_attacks",
    "7": "modern_sqli",
    "8": "modern_ssrf",
    "9": "modern_xss",
    "10": "nosql_injection",
    "11": "open_redirect",
    "12": "path_traversal",
    "13": "prototype_pollution",
    "14": "sqli",
    "15": "ssrf",
    "16": "template_injection",
    "17": "xss",
    "18": "xxe_injection"
  },
  "initializer_range": 0.02,
  "label2id": {
    "benign": 0,
    "deserialization": 1,
    "graphql_attacks": 2,
    "jwt_attacks": 3,
    "lfi": 4,
    "modern_cmdi": 5,
    "modern_file_attacks": 6,
    "modern_sqli": 7,
    "modern_ssrf": 8,
    "modern_xss": 9,
    "nosql_injection": 10,
    "open_redirect": 11,
    "path_traversal": 12,
    "prototype_pollution": 13,
    "sqli": 14,
    "ssrf": 15,
    "template_injection": 16,
    "xss": 17,
    "xxe_injection": 18
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 30522
}
